---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalDBApplicationResult.Succeeded
enum: Autodesk.Revit.DB.ExternalDBApplicationResult
source: html/d7873d96-ce3d-a8d1-d1d7-c95b65fd79b8.htm
---
# Autodesk.Revit.DB.ExternalDBApplicationResult.Succeeded

The external db application completed successfully. Autodesk Revit will keep this object
during the entire Revit session.